<!-- terraform cdk action for options with hash 89626a10706fa01ff1451da27e7d2a5d -->
### ✅ Successfully planned Terraform CDK Stack 'graasp-dev'



<details><summary>Show Plan</summary>

```shell
npm WARN deprecated @npmcli/ci-detect@1.4.0: this package has been deprecated, use `ci-info` instead
graasp-dev  Initializing the backend...
graasp-dev  Successfully configured the backend "s3"! Terraform will automatically
            use this backend unless the backend configuration changes.
graasp-dev  Initializing modules...
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.1.1 for graasp-dev-etherpad-postgres_db_17D31B7A...
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_instance in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_instance
graasp-dev
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_option_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_option_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_parameter_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_parameter_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_subnet_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_subnet_group
            Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.1.1 for graasp-dev-postgres_db_F1D5DB7A...
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_option_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_option_group
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_parameter_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_parameter_group
            - graasp-dev-postgres_db_F1D5DB7A.db_subnet_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.1.2 for vpc...
graasp-dev  - vpc in .terraform/modules/vpc
graasp-dev  Initializing provider plugins...
graasp-dev  - Finding hashicorp/aws versions matching ">= 5.0.0, 5.16.1"...
graasp-dev  - Finding hashicorp/random versions matching ">= 3.1.0"...
graasp-dev  - Installing hashicorp/aws v5.16.1...
graasp-dev  - Installed hashicorp/aws v5.16.1 (signed by HashiCorp)
graasp-dev  - Installing hashicorp/random v3.5.1...
graasp-dev  - Installed hashicorp/random v3.5.1 (signed by HashiCorp)
graasp-dev  Terraform has created a lock file .terraform.lock.hcl to record the provider
            selections it made above. Include this file in your version control repository
            so that Terraform can guarantee to make the same selections by default when
            you run "terraform init" in the future.

            Terraform has been successfully initialized!

            You may now begin working with Terraform. Try running "terraform plan" to see
            any changes that are required for your infrastructure. All Terraform commands
            should now work.

            If you ever set or change modules or backend configuration for Terraform,
            rerun this command to reinitialize your working directory. If you forget, other
            commands will detect it and remind you to do so if necessary.
graasp-dev  - Fetching hashicorp/random 3.5.1 for linux_amd64...
graasp-dev  - Retrieved hashicorp/random 3.5.1 for linux_amd64 (signed by HashiCorp)
graasp-dev  - Fetching hashicorp/aws 5.16.1 for linux_amd64...
graasp-dev  - Retrieved hashicorp/aws 5.16.1 for linux_amd64 (signed by HashiCorp)
            - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
            - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
graasp-dev  Success! Terraform has validated the lock file and found no need for changes.
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Read complete after 1s [id=arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Reading...
            data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Reading...
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
            data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Reading...
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Read complete after 1s [id=graasp/explore]
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Read complete after 1s [id=graasp/etherpad]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Read complete after 1s [id=graasp]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Read complete after 1s [id=arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3]
graasp-dev  Terraform used the selected providers to generate the following execution
            plan. Resource actions are indicated with the following symbols:
              + create
             <= read (data resources)

            Terraform will perform the following actions:
graasp-dev  # data.aws_iam_policy_document.graasp-dev-account_allow_public_access_4663AEFE (graasp-dev-account/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-account_allow_public_access_4663AEFE" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-admin_allow_public_access_C4AD10BD (graasp-dev-admin/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-admin_allow_public_access_C4AD10BD" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-analyzer_allow_public_access_9E526C27 (graasp-dev-analyzer/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-analyzer_allow_public_access_9E526C27" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-apps_allow_public_access_9E010C09" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-assets_allow_public_access_59580A32" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-auth_allow_public_access_0D0CE7D9 (graasp-dev-auth/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-auth_allow_public_access_0D0CE7D9" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }
graasp-dev  # data.aws_iam_policy_document.graasp-dev-builder_allow_public_access_17867863 (graasp-dev-builder/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-builder_allow_public_access_17867863" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-h5p_allow_public_access_04C01E9A" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-maintenance_allow_public_access_8F6F3848" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-pdfviewer_allow_public_access_C6932A24 (graasp-dev-pdfviewer/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-pdfviewer_allow_public_access_C6932A24" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # data.aws_iam_policy_document.graasp-dev-player_allow_public_access_AB634BF6 (graasp-dev-player/allow_public_access) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "graasp-dev-player_allow_public_access_AB634BF6" {
                  + id      = (known after apply)
                  + json    = (known after apply)
                  + version = "2012-10-17"

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "PublicReadForGetBucketObjects"

                      + principals {
                          + identifiers = [
                              + "*",
                            ]
                          + type        = "*"
                        }
                    }
                }

              # aws_appautoscaling_policy.graasp-dev_graasp-library-service-autoscaling-policy_E718A88F (graasp-dev/graasp-library-service-autoscaling-policy) will be created
              + resource "aws_appautoscaling_policy" "graasp-dev_graasp-library-service-autoscaling-policy_E718A88F" {
                  + alarm_arns         = (known after apply)
                  + arn                = (known after apply)
                  + id                 = (known after apply)
                  + name               = "graasp-library"
                  + policy_type        = "TargetTrackingScaling"
                  + resource_id        = "service/graasp-dev/graasp-library"
                  + scalable_dimension = "ecs:service:DesiredCount"
                  + service_namespace  = "ecs"

                  + target_tracking_scaling_policy_configuration {
                      + disable_scale_in   = false
                      + scale_in_cooldown  = 10
                      + scale_out_cooldown = 300
                      + target_value       = 80

                      + predefined_metric_specification {
                          + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
                        }
                    }
                }

              # aws_appautoscaling_policy.graasp-dev_graasp-service-autoscaling-policy_70C429DA (graasp-dev/graasp-service-autoscaling-policy) will be created
              + resource "aws_appautoscaling_policy" "graasp-dev_graasp-service-autoscaling-policy_70C429DA" {
                  + alarm_arns         = (known after apply)
                  + arn                = (known after apply)
                  + id                 = (known after apply)
                  + name               = "graasp"
                  + policy_type        = "TargetTrackingScaling"
                  + resource_id        = "service/graasp-dev/graasp"
                  + scalable_dimension = "ecs:service:DesiredCount"
                  + service_namespace  = "ecs"

                  + target_tracking_scaling_policy_configuration {
                      + disable_scale_in   = false
                      + scale_in_cooldown  = 30
                      + scale_out_cooldown = 300
                      + target_value       = 70

                      + predefined_metric_specification {
                          + predefined_metric_type = "ECSServiceAverageCPUUtilization"
                        }
                    }
                }

              # aws_appautoscaling_target.graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D (graasp-dev/graasp-library-service-autoscaling-target) will be created
              + resource "aws_appautoscaling_target" "graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D" {
                  + arn                = (known after apply)
                  + id                 = (known after apply)
                  + max_capacity       = 8
                  + min_capacity       = 1
                  + resource_id        = "service/graasp-dev/graasp-library"
                  + role_arn           = (known after apply)
                  + scalable_dimension = "ecs:service:DesiredCount"
                  + service_namespace  = "ecs"
                  + tags_all           = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_appautoscaling_target.graasp-dev_graasp-service-autoscaling-target_517CCDCE (graasp-dev/graasp-service-autoscaling-target) will be created
              + resource "aws_appautoscaling_target" "graasp-dev_graasp-service-autoscaling-target_517CCDCE" {
                  + arn                = (known after apply)
                  + id                 = (known after apply)
                  + max_capacity       = 8
                  + min_capacity       = 1
                  + resource_id        = "service/graasp-dev/graasp"
                  + role_arn           = (known after apply)
                  + scalable_dimension = "ecs:service:DesiredCount"
                  + service_namespace  = "ecs"
                  + tags_all           = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-account-cloudfront (graasp-dev-account-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-account-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "account"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "account"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "account"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-admin-cloudfront (graasp-dev-admin-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-admin-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "admin"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "admin"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "admin"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-analyzer-cloudfront (graasp-dev-analyzer-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-analyzer-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "analyzer"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "analyzer"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "analyzer"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-apps-cloudfront (graasp-dev-apps-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-apps-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "apps"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "apps"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "apps"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-assets-cloudfront (graasp-dev-assets-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-assets-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "assets"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "assets"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "assets"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-auth-cloudfront (graasp-dev-auth-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-auth-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "auth"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "auth"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "auth"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-builder-cloudfront (graasp-dev-builder-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-builder-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "builder"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "builder"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "builder"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-h5p-cloudfront (graasp-dev-h5p-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-h5p-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "h5p"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "h5p"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "h5p"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-maintenance-cloudfront (graasp-dev-maintenance-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-maintenance-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "maintenance"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "maintenance"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "maintenance"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-pdfviewer-cloudfront (graasp-dev-pdfviewer-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-pdfviewer-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "pdfviewer"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "pdfviewer"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "pdfviewer"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudfront_distribution.graasp-dev-player-cloudfront (graasp-dev-player-cloudfront) will be created
              + resource "aws_cloudfront_distribution" "graasp-dev-player-cloudfront" {
                  + arn                            = (known after apply)
                  + caller_reference               = (known after apply)
                  + comment                        = "player"
                  + default_root_object            = "index.html"
                  + domain_name                    = (known after apply)
                  + enabled                        = true
                  + etag                           = (known after apply)
                  + hosted_zone_id                 = (known after apply)
                  + http_version                   = "http2"
                  + id                             = (known after apply)
                  + in_progress_validation_batches = (known after apply)
                  + is_ipv6_enabled                = false
                  + last_modified_time             = (known after apply)
                  + price_class                    = "PriceClass_All"
                  + retain_on_delete               = false
                  + staging                        = false
                  + status                         = (known after apply)
                  + tags_all                       = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups             = (known after apply)
                  + trusted_signers                = (known after apply)
                  + wait_for_deployment            = true

                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 403
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }
                  + custom_error_response {
                      + error_caching_min_ttl = 10
                      + error_code            = 404
                      + response_code         = 200
                      + response_page_path    = "/index.html"
                    }

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "player"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"
                    }

                  + origin {
                      + connection_attempts = 3
                      + connection_timeout  = 10
                      + domain_name         = (known after apply)
                      + origin_id           = "player"
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_cloudwatch_log_group.graasp-dev_etherpad-loggroup_200385B4 (graasp-dev/etherpad-loggroup) will be created
              + resource "aws_cloudwatch_log_group" "graasp-dev_etherpad-loggroup_200385B4" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + name              = "/ecs/etherpad"
                  + name_prefix       = (known after apply)
                  + retention_in_days = 30
                  + skip_destroy      = false
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_cloudwatch_log_group.graasp-dev_graasp-library-loggroup_FD22B99E (graasp-dev/graasp-library-loggroup) will be created
              + resource "aws_cloudwatch_log_group" "graasp-dev_graasp-library-loggroup_FD22B99E" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + name              = "/ecs/graasp-library"
                  + name_prefix       = (known after apply)
                  + retention_in_days = 30
                  + skip_destroy      = false
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_cloudwatch_log_group.graasp-dev_graasp-loggroup_44ECC8C2 (graasp-dev/graasp-loggroup) will be created
              + resource "aws_cloudwatch_log_group" "graasp-dev_graasp-loggroup_44ECC8C2" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + name              = "/ecs/graasp"
                  + name_prefix       = (known after apply)
                  + retention_in_days = 30
                  + skip_destroy      = false
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_cloudwatch_log_group.graasp-dev_meilisearch-loggroup_F1AD2775 (graasp-dev/meilisearch-loggroup) will be created
              + resource "aws_cloudwatch_log_group" "graasp-dev_meilisearch-loggroup_F1AD2775" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + name              = "/ecs/meilisearch"
                  + name_prefix       = (known after apply)
                  + retention_in_days = 30
                  + skip_destroy      = false
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_cluster.cluster (cluster) will be created
              + resource "aws_ecs_cluster" "cluster" {
                  + arn      = (known after apply)
                  + id       = (known after apply)
                  + name     = "graasp-dev"
                  + tags_all = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service) will be created
              + resource "aws_ecs_service" "graasp-dev_etherpad-service_366B5CFC" {
                  + cluster                            = (known after apply)
                  + deployment_maximum_percent         = 200
                  + deployment_minimum_healthy_percent = 100
                  + desired_count                      = 1
                  + enable_ecs_managed_tags            = false
                  + enable_execute_command             = false
                  + iam_role                           = (known after apply)
                  + id                                 = (known after apply)
                  + launch_type                        = "FARGATE"
                  + name                               = "etherpad"
                  + platform_version                   = (known after apply)
                  + scheduling_strategy                = "REPLICA"
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + task_definition                    = (known after apply)
                  + triggers                           = (known after apply)
                  + wait_for_steady_state              = false

                  + network_configuration {
                      + assign_public_ip = true
                      + security_groups  = (known after apply)
                      + subnets          = (known after apply)
                    }

                  + service_connect_configuration {
                      + enabled   = true
                      + namespace = (known after apply)
                    }
                }

              # aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service) will be created
              + resource "aws_ecs_service" "graasp-dev_graasp-library-service_35621E15" {
                  + cluster                            = (known after apply)
                  + deployment_maximum_percent         = 200
                  + deployment_minimum_healthy_percent = 100
                  + desired_count                      = 1
                  + enable_ecs_managed_tags            = false
                  + enable_execute_command             = false
                  + iam_role                           = (known after apply)
                  + id                                 = (known after apply)
                  + launch_type                        = "FARGATE"
                  + name                               = "graasp-library"
                  + platform_version                   = (known after apply)
                  + scheduling_strategy                = "REPLICA"
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + task_definition                    = (known after apply)
                  + triggers                           = (known after apply)
                  + wait_for_steady_state              = false

                  + network_configuration {
                      + assign_public_ip = true
                      + security_groups  = (known after apply)
                      + subnets          = (known after apply)
                    }

                  + service_connect_configuration {
                      + enabled   = true
                      + namespace = (known after apply)
                    }
                }

              # aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service) will be created
              + resource "aws_ecs_service" "graasp-dev_graasp-service_BD538BD2" {
                  + cluster                            = (known after apply)
                  + deployment_maximum_percent         = 200
                  + deployment_minimum_healthy_percent = 100
                  + desired_count                      = 1
                  + enable_ecs_managed_tags            = false
                  + enable_execute_command             = false
                  + iam_role                           = (known after apply)
                  + id                                 = (known after apply)
                  + launch_type                        = "FARGATE"
                  + name                               = "graasp"
                  + platform_version                   = (known after apply)
                  + scheduling_strategy                = "REPLICA"
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + task_definition                    = (known after apply)
                  + triggers                           = (known after apply)
                  + wait_for_steady_state              = false

                  + network_configuration {
                      + assign_public_ip = true
                      + security_groups  = (known after apply)
                      + subnets          = (known after apply)
                    }

                  + service_connect_configuration {
                      + enabled   = true
                      + namespace = (known after apply)
                    }
                }

              # aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service) will be created
              + resource "aws_ecs_service" "graasp-dev_meilisearch-service_3A736F80" {
                  + cluster                            = (known after apply)
                  + deployment_maximum_percent         = 200
                  + deployment_minimum_healthy_percent = 100
                  + desired_count                      = 1
                  + enable_ecs_managed_tags            = false
                  + enable_execute_command             = false
                  + iam_role                           = (known after apply)
                  + id                                 = (known after apply)
                  + launch_type                        = "FARGATE"
                  + name                               = "meilisearch"
                  + platform_version                   = (known after apply)
                  + scheduling_strategy                = "REPLICA"
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + task_definition                    = (known after apply)
                  + triggers                           = (known after apply)
                  + wait_for_steady_state              = false

                  + network_configuration {
                      + assign_public_ip = true
                      + security_groups  = (known after apply)
                      + subnets          = (known after apply)
                    }

                  + service_connect_configuration {
                      + enabled   = true
                      + namespace = (known after apply)

                      + service {
                          + discovery_name = "graasp-meilisearch"
                          + port_name      = "meilisearch-7700-tcp"

                          + client_alias {
                              + dns_name = "graasp-meilisearch"
                              + port     = 7700
                            }
                        }
                    }
                }

              # aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad) will be created
              + resource "aws_ecs_task_definition" "graasp-dev_etherpad_D664EB2D" {
                  + arn                      = (known after apply)
                  + arn_without_revision     = (known after apply)
                  + container_definitions    = (known after apply)
                  + cpu                      = "256"
                  + execution_role_arn       = (known after apply)
                  + family                   = "etherpad"
                  + id                       = (known after apply)
                  + memory                   = "512"
                  + network_mode             = "awsvpc"
                  + requires_compatibilities = [
                      + "FARGATE",
                    ]
                  + revision                 = (known after apply)
                  + skip_destroy             = false
                  + tags_all                 = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library) will be created
              + resource "aws_ecs_task_definition" "graasp-dev_graasp-library_B38B90C0" {
                  + arn                      = (known after apply)
                  + arn_without_revision     = (known after apply)
                  + container_definitions    = jsonencode(
                        [
                          + {
                              + command          = [
                                  + "/bin/sh",
                                  + "-c",
                                  + "while true; do sleep 30; done",
                                ]
                              + environment      = []
                              + image            = "busybox:1.36"
                              + logConfiguration = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/ecs/graasp"
                                      + awslogs-region        = "eu-central-1"
                                      + awslogs-stream-prefix = "ecs"
                                    }
                                }
                              + name             = "graasp"
                              + portMappings     = []
                            },
                        ]
                    )
                  + cpu                      = "1024"
                  + execution_role_arn       = (known after apply)
                  + family                   = "graasp-library"
                  + id                       = (known after apply)
                  + memory                   = "3072"
                  + network_mode             = "awsvpc"
                  + requires_compatibilities = [
                      + "FARGATE",
                    ]
                  + revision                 = (known after apply)
                  + skip_destroy             = false
                  + tags_all                 = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp) will be created
              + resource "aws_ecs_task_definition" "graasp-dev_graasp_54E40EB5" {
                  + arn                      = (known after apply)
                  + arn_without_revision     = (known after apply)
                  + container_definitions    = jsonencode(
                        [
                          + {
                              + command          = [
                                  + "/bin/sh",
                                  + "-c",
                                  + "while true; do sleep 30; done",
                                ]
                              + environment      = []
                              + image            = "busybox:1.36"
                              + logConfiguration = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/ecs/graasp"
                                      + awslogs-region        = "eu-central-1"
                                      + awslogs-stream-prefix = "ecs"
                                    }
                                }
                              + name             = "graasp"
                              + portMappings     = []
                            },
                        ]
                    )
                  + cpu                      = "1024"
                  + execution_role_arn       = (known after apply)
                  + family                   = "graasp"
                  + id                       = (known after apply)
                  + memory                   = "3072"
                  + network_mode             = "awsvpc"
                  + requires_compatibilities = [
                      + "FARGATE",
                    ]
                  + revision                 = (known after apply)
                  + skip_destroy             = false
                  + tags_all                 = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch) will be created
              + resource "aws_ecs_task_definition" "graasp-dev_meilisearch_38A3D0B6" {
                  + arn                      = (known after apply)
                  + arn_without_revision     = (known after apply)
                  + container_definitions    = jsonencode(
                        [
                          + {
                              + environment      = [
                                  + {
                                      + name  = "MEILI_ENV"
                                      + value = "production"
                                    },
                                  + {
                                      + name  = "MEILI_MASTER_KEY"
                                      + value = "<unresolved-token>"
                                    },
                                  + {
                                      + name  = "MEILI_NO_ANALYTICS"
                                      + value = "true"
                                    },
                                ]
                              + image            = "getmeili/meilisearch:v1.2"
                              + logConfiguration = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/ecs/meilisearch"
                                      + awslogs-region        = "eu-central-1"
                                      + awslogs-stream-prefix = "ecs"
                                    }
                                }
                              + name             = "meilisearch"
                              + portMappings     = [
                                  + {
                                      + containerPort = 7700
                                      + hostPort      = 7700
                                      + name          = "meilisearch-7700-tcp"
                                    },
                                ]
                            },
                        ]
                    )
                  + cpu                      = "256"
                  + execution_role_arn       = (known after apply)
                  + family                   = "meilisearch"
                  + id                       = (known after apply)
                  + memory                   = "512"
                  + network_mode             = "awsvpc"
                  + requires_compatibilities = [
                      + "FARGATE",
                    ]
                  + revision                 = (known after apply)
                  + skip_destroy             = false
                  + tags_all                 = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_elasticache_cluster.graasp-dev-redis_C864F0E3 (graasp-dev-redis/graasp-dev-redis) will be created
              + resource "aws_elasticache_cluster" "graasp-dev-redis_C864F0E3" {
                  + apply_immediately          = (known after apply)
                  + arn                        = (known after apply)
                  + auto_minor_version_upgrade = "true"
                  + availability_zone          = (known after apply)
                  + az_mode                    = (known after apply)
                  + cache_nodes                = (known after apply)
                  + cluster_address            = (known after apply)
                  + cluster_id                 = "graasp-dev-redis"
                  + configuration_endpoint     = (known after apply)
                  + engine                     = "redis"
                  + engine_version             = "6.0"
                  + engine_version_actual      = (known after apply)
                  + id                         = (known after apply)
                  + ip_discovery               = (known after apply)
                  + maintenance_window         = (known after apply)
                  + network_type               = (known after apply)
                  + node_type                  = "cache.t2.micro"
                  + num_cache_nodes            = 1
                  + parameter_group_name       = "default.redis6.x"
                  + port                       = 6379
                  + preferred_outpost_arn      = (known after apply)
                  + replication_group_id       = (known after apply)
                  + security_group_ids         = (known after apply)
                  + snapshot_window            = (known after apply)
                  + subnet_group_name          = "graasp-dev"
                  + tags_all                   = {
                      + "terraform-managed" = "true"
                    }
                  + transit_encryption_enabled = false
                }

              # aws_elasticache_subnet_group.graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD (graasp-dev-redis/graasp-dev-redis-subnet-group) will be created
              + resource "aws_elasticache_subnet_group" "graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD" {
                  + arn         = (known after apply)
                  + description = "Managed by Terraform"
                  + id          = (known after apply)
                  + name        = "graasp-dev"
                  + subnet_ids  = (known after apply)
                  + tags_all    = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_iam_role.graasp-dev_ecs-execution-role_A4D135E8 (graasp-dev/ecs-execution-role) will be created
              + resource "aws_iam_role" "graasp-dev_ecs-execution-role_A4D135E8" {
                  + arn                   = (known after apply)
                  + assume_role_policy    = jsonencode(
                        {
                          + Statement = [
                              + {
                                  + Action    = "sts:AssumeRole"
                                  + Effect    = "Allow"
                                  + Principal = {
                                      + Service = "ecs-tasks.amazonaws.com"
                                    }
                                  + Sid       = ""
                                },
                            ]
                          + Version   = "2012-10-17"
                        }
                    )
                  + create_date           = (known after apply)
                  + force_detach_policies = false
                  + id                    = (known after apply)
                  + managed_policy_arns   = (known after apply)
                  + max_session_duration  = 3600
                  + name                  = "graasp-dev-ecs-execution-role"
                  + name_prefix           = (known after apply)
                  + path                  = "/"
                  + tags_all              = {
                      + "terraform-managed" = "true"
                    }
                  + unique_id             = (known after apply)

                  + inline_policy {
                      + name   = "allow-ecr-pull"
                      + policy = jsonencode(
                            {
                              + Statement = [
                                  + {
                                      + Action   = [
                                          + "ecr:GetAuthorizationToken",
                                          + "ecr:BatchCheckLayerAvailability",
                                          + "ecr:GetDownloadUrlForLayer",
                                          + "ecr:BatchGetImage",
                                          + "logs:CreateLogStream",
                                          + "logs:PutLogEvents",
                                        ]
                                      + Effect   = "Allow"
                                      + Resource = "*"
                                    },
                                ]
                              + Version   = "2012-10-17"
                            }
                        )
                    }
                }

              # aws_lb.graasp-dev-load-balancer_lb_9A06B77C (graasp-dev-load-balancer/lb) will be created
              + resource "aws_lb" "graasp-dev-load-balancer_lb_9A06B77C" {
                  + arn                                         = (known after apply)
                  + arn_suffix                                  = (known after apply)
                  + desync_mitigation_mode                      = "defensive"
                  + dns_name                                    = (known after apply)
                  + drop_invalid_header_fields                  = false
                  + enable_deletion_protection                  = false
                  + enable_http2                                = true
                  + enable_tls_version_and_cipher_suite_headers = false
                  + enable_waf_fail_open                        = false
                  + enable_xff_client_port                      = false
                  + id                                          = (known after apply)
                  + idle_timeout                                = 60
                  + internal                                    = false
                  + ip_address_type                             = (known after apply)
                  + load_balancer_type                          = "application"
                  + name                                        = "graasp-dev"
                  + preserve_host_header                        = false
                  + security_groups                             = (known after apply)
                  + subnets                                     = (known after apply)
                  + tags_all                                    = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                                      = (known after apply)
                  + xff_header_processing_mode                  = "append"
                  + zone_id                                     = (known after apply)
                }

              # aws_lb_listener.graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64 (graasp-dev-load-balancer/lb-listener-http-redirect) will be created
              + resource "aws_lb_listener" "graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + load_balancer_arn = (known after apply)
                  + port              = 80
                  + protocol          = "HTTP"
                  + ssl_policy        = (known after apply)
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }

                  + default_action {
                      + order = (known after apply)
                      + type  = "redirect"

                      + redirect {
                          + host        = "#{host}"
                          + path        = "/#{path}"
                          + port        = "443"
                          + protocol    = "HTTPS"
                          + query       = "#{query}"
                          + status_code = "HTTP_301"
                        }
                    }
                }

              # aws_lb_listener.graasp-dev-load-balancer_lb-listener-https_E069C227 (graasp-dev-load-balancer/lb-listener-https) will be created
              + resource "aws_lb_listener" "graasp-dev-load-balancer_lb-listener-https_E069C227" {
                  + arn               = (known after apply)
                  + certificate_arn   = "arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3"
                  + id                = (known after apply)
                  + load_balancer_arn = (known after apply)
                  + port              = 443
                  + protocol          = "HTTPS"
                  + ssl_policy        = "ELBSecurityPolicy-2016-08"
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }

                  + default_action {
                      + order = (known after apply)
                      + type  = "fixed-response"

                      + fixed_response {
                          + content_type = "text/plain"
                          + status_code  = "503"
                        }
                    }
                }

              # aws_lb_listener_rule.graasp-dev_etherpad-rule_74CA3679 (graasp-dev/etherpad-rule) will be created
              + resource "aws_lb_listener_rule" "graasp-dev_etherpad-rule_74CA3679" {
                  + arn          = (known after apply)
                  + id           = (known after apply)
                  + listener_arn = (known after apply)
                  + priority     = 3
                  + tags_all     = {
                      + "terraform-managed" = "true"
                    }

                  + action {
                      + order            = (known after apply)
                      + target_group_arn = (known after apply)
                      + type             = "forward"
                    }

                  + condition {
                      + host_header {
                          + values = [
                              + "etherpad.dev.graasp.org",
                            ]
                        }
                    }
                }

              # aws_lb_listener_rule.graasp-dev_graasp-library-rule_AC381C09 (graasp-dev/graasp-library-rule) will be created
              + resource "aws_lb_listener_rule" "graasp-dev_graasp-library-rule_AC381C09" {
                  + arn          = (known after apply)
                  + id           = (known after apply)
                  + listener_arn = (known after apply)
                  + priority     = 2
                  + tags_all     = {
                      + "terraform-managed" = "true"
                    }

                  + action {
                      + order            = (known after apply)
                      + target_group_arn = (known after apply)
                      + type             = "forward"
                    }

                  + condition {
                      + host_header {
                          + valu
graasp-dev  es = [
                              + "library.dev.graasp.org",
                            ]
                        }
                    }
                }

              # aws_lb_listener_rule.graasp-dev_graasp-rule_8589AD50 (graasp-dev/graasp-rule) will be created
              + resource "aws_lb_listener_rule" "graasp-dev_graasp-rule_8589AD50" {
                  + arn          = (known after apply)
                  + id           = (known after apply)
                  + listener_arn = (known after apply)
                  + priority     = 1
                  + tags_all     = {
                      + "terraform-managed" = "true"
                    }

                  + action {
                      + order            = (known after apply)
                      + target_group_arn = (known after apply)
                      + type             = "forward"
                    }

                  + condition {
                      + host_header {
                          + values = [
                              + "api.dev.graasp.org",
                            ]
                        }
                    }
                }

              # aws_lb_target_group.graasp-dev_etherpad-target-group_94F8091C (graasp-dev/etherpad-target-group) will be created
              + resource "aws_lb_target_group" "graasp-dev_etherpad-target-group_94F8091C" {
                  + arn                                = (known after apply)
                  + arn_suffix                         = (known after apply)
                  + connection_termination             = false
                  + deregistration_delay               = "300"
                  + id                                 = (known after apply)
                  + ip_address_type                    = (known after apply)
                  + lambda_multi_value_headers_enabled = false
                  + load_balancing_algorithm_type      = (known after apply)
                  + load_balancing_cross_zone_enabled  = (known after apply)
                  + name                               = "etherpad"
                  + port                               = 9001
                  + preserve_client_ip                 = (known after apply)
                  + protocol                           = "HTTP"
                  + protocol_version                   = (known after apply)
                  + proxy_protocol_v2                  = false
                  + slow_start                         = 0
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + target_type                        = "ip"
                  + vpc_id                             = (known after apply)

                  + health_check {
                      + enabled             = true
                      + healthy_threshold   = 5
                      + interval            = 30
                      + matcher             = (known after apply)
                      + path                = "/status"
                      + port                = "traffic-port"
                      + protocol            = "HTTP"
                      + timeout             = 5
                      + unhealthy_threshold = 2
                    }
                }

              # aws_lb_target_group.graasp-dev_graasp-library-target-group_47035354 (graasp-dev/graasp-library-target-group) will be created
              + resource "aws_lb_target_group" "graasp-dev_graasp-library-target-group_47035354" {
                  + arn                                = (known after apply)
                  + arn_suffix                         = (known after apply)
                  + connection_termination             = false
                  + deregistration_delay               = "300"
                  + id                                 = (known after apply)
                  + ip_address_type                    = (known after apply)
                  + lambda_multi_value_headers_enabled = false
                  + load_balancing_algorithm_type      = (known after apply)
                  + load_balancing_cross_zone_enabled  = (known after apply)
                  + name                               = "graasp-library"
                  + port                               = 3005
                  + preserve_client_ip                 = (known after apply)
                  + protocol                           = "HTTP"
                  + protocol_version                   = (known after apply)
                  + proxy_protocol_v2                  = false
                  + slow_start                         = 0
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + target_type                        = "ip"
                  + vpc_id                             = (known after apply)

                  + health_check {
                      + enabled             = true
                      + healthy_threshold   = 5
                      + interval            = 30
                      + matcher             = (known after apply)
                      + path                = "/status"
                      + port                = "traffic-port"
                      + protocol            = "HTTP"
                      + timeout             = 5
                      + unhealthy_threshold = 2
                    }
                }

              # aws_lb_target_group.graasp-dev_graasp-target-group_7E05BC31 (graasp-dev/graasp-target-group) will be created
              + resource "aws_lb_target_group" "graasp-dev_graasp-target-group_7E05BC31" {
                  + arn                                = (known after apply)
                  + arn_suffix                         = (known after apply)
                  + connection_termination             = false
                  + deregistration_delay               = "300"
                  + id                                 = (known after apply)
                  + ip_address_type                    = (known after apply)
                  + lambda_multi_value_headers_enabled = false
                  + load_balancing_algorithm_type      = (known after apply)
                  + load_balancing_cross_zone_enabled  = (known after apply)
                  + name                               = "graasp"
                  + port                               = 3111
                  + preserve_client_ip                 = (known after apply)
                  + protocol                           = "HTTP"
                  + protocol_version                   = (known after apply)
                  + proxy_protocol_v2                  = false
                  + slow_start                         = 0
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + target_type                        = "ip"
                  + vpc_id                             = (known after apply)

                  + health_check {
                      + enabled             = true
                      + healthy_threshold   = 5
                      + interval            = 30
                      + matcher             = (known after apply)
                      + path                = "/status"
                      + port                = "traffic-port"
                      + protocol            = "HTTP"
                      + timeout             = 5
                      + unhealthy_threshold = 2
                    }
                }

              # aws_s3_bucket.graasp-dev-account_bucket_17879B4C (graasp-dev-account/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-account_bucket_17879B4C" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-account"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-admin_bucket_CD8D86EC (graasp-dev-admin/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-admin_bucket_CD8D86EC" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-admin"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-analyzer_bucket_C0835793 (graasp-dev-analyzer/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-analyzer_bucket_C0835793" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-analyzer"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-apps_bucket_F4170225 (graasp-dev-apps/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-apps_bucket_F4170225" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-apps"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-assets_bucket_8930785E (graasp-dev-assets/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-assets_bucket_8930785E" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-assets"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-auth_bucket_09E0996B (graasp-dev-auth/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-auth_bucket_09E0996B" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-auth"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-builder_bucket_E21AE40A (graasp-dev-builder/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-builder_bucket_E21AE40A" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-builder"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-file-items_bucket_12606B30 (graasp-dev-file-items/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-file-items_bucket_12606B30" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-file-items"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-h5p_bucket_B545A43B (graasp-dev-h5p/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-h5p_bucket_B545A43B" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-h5p"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-maintenance_bucket_46B8FAD7 (graasp-dev-maintenance/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-maintenance_bucket_46B8FAD7" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-maintenance"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-pdfviewer_bucket_F3C72990 (graasp-dev-pdfviewer/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-pdfviewer_bucket_F3C72990" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-pdfviewer"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket.graasp-dev-player_bucket_F2A2D347 (graasp-dev-player/bucket) will be created
              + resource "aws_s3_bucket" "graasp-dev-player_bucket_F2A2D347" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "graasp-dev-player"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = (known after apply)
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)
                }

              # aws_s3_bucket_cors_configuration.graasp-dev-file-items_s3-cors-config_531774F3 (graasp-dev-file-items/s3-cors-config) will be created
              + resource "aws_s3_bucket_cors_configuration" "graasp-dev-file-items_s3-cors-config_531774F3" {
                  + bucket = (known after apply)
                  + id     = (known after apply)

                  + cors_rule {
                      + allowed_headers = [
                          + "*",
                        ]
                      + allowed_methods = [
                          + "DELETE",
                          + "GET",
                          + "HEAD",
                          + "PUT",
                        ]
                      + allowed_origins = [
                          + "null",
                        ]
                      + expose_headers  = []
                    }
                  + cors_rule {
                      + allowed_headers = [
                          + "*",
                        ]
                      + allowed_methods = [
                          + "GET",
                          + "HEAD",
                        ]
                      + allowed_origins = [
                          + "*",
                        ]
                      + expose_headers  = []
                    }
                  + cors_rule {
                      + allowed_headers = [
                          + "*",
                        ]
                      + allowed_methods = [
                          + "GET",
                        ]
                      + allowed_origins = [
                          + "https://assets.dev.graasp.org",
                        ]
                      + expose_headers  = []
                    }
                }

              # aws_s3_bucket_policy.graasp-dev-account_s3-policy_02771A3D (graasp-dev-account/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-account_s3-policy_02771A3D" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-admin_s3-policy_1AE743F7 (graasp-dev-admin/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-admin_s3-policy_1AE743F7" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-analyzer_s3-policy_22BD5C56 (graasp-dev-analyzer/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-analyzer_s3-policy_22BD5C56" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-apps_s3-policy_708B7B00 (graasp-dev-apps/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-apps_s3-policy_708B7B00" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-assets_s3-policy_B5DD3F7D (graasp-dev-assets/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-assets_s3-policy_B5DD3F7D" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-auth_s3-policy_E1D1F49B (graasp-dev-auth/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-auth_s3-policy_E1D1F49B" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-builder_s3-policy_0743ACD6 (graasp-dev-builder/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-builder_s3-policy_0743ACD6" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }
graasp-dev  # aws_s3_bucket_policy.graasp-dev-h5p_s3-policy_9DB0282E (graasp-dev-h5p/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-h5p_s3-policy_9DB0282E" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-maintenance_s3-policy_DA8583B1 (graasp-dev-maintenance/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-maintenance_s3-policy_DA8583B1" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-pdfviewer_s3-policy_367A9C87 (graasp-dev-pdfviewer/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-pdfviewer_s3-policy_367A9C87" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_policy.graasp-dev-player_s3-policy_79B5A424 (graasp-dev-player/s3-policy) will be created
              + resource "aws_s3_bucket_policy" "graasp-dev-player_s3-policy_79B5A424" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                }

              # aws_s3_bucket_public_access_block.graasp-dev-account_s3-block-public-access_882CFDD8 (graasp-dev-account/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-account_s3-block-public-access_882CFDD8" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-admin_s3-block-public-access_CE38E6EE (graasp-dev-admin/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-admin_s3-block-public-access_CE38E6EE" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-analyzer_s3-block-public-access_9B27D072 (graasp-dev-analyzer/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-analyzer_s3-block-public-access_9B27D072" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-apps_s3-block-public-access_05DA1D21 (graasp-dev-apps/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-apps_s3-block-public-access_05DA1D21" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-assets_s3-block-public-access_D15DF7EF (graasp-dev-assets/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-assets_s3-block-public-access_D15DF7EF" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-auth_s3-block-public-access_61A2029D (graasp-dev-auth/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-auth_s3-block-public-access_61A2029D" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-builder_s3-block-public-access_E82A62FB (graasp-dev-builder/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-builder_s3-block-public-access_E82A62FB" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-file-items_s3-block-public-access_DD6519C0 (graasp-dev-file-items/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-file-items_s3-block-public-access_DD6519C0" {
                  + block_public_acls       = true
                  + block_public_policy     = true
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = true
                  + restrict_public_buckets = true
                }

              # aws_s3_bucket_public_access_block.graasp-dev-h5p_s3-block-public-access_2D472005 (graasp-dev-h5p/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-h5p_s3-block-public-access_2D472005" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-maintenance_s3-block-public-access_C8FD87F8 (graasp-dev-maintenance/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-maintenance_s3-block-public-access_C8FD87F8" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-pdfviewer_s3-block-public-access_241FAC6C (graasp-dev-pdfviewer/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-pdfviewer_s3-block-public-access_241FAC6C" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_public_access_block.graasp-dev-player_s3-block-public-access_2D924E86 (graasp-dev-player/s3-block-public-access) will be created
              + resource "aws_s3_bucket_public_access_block" "graasp-dev-player_s3-block-public-access_2D924E86" {
                  + block_public_acls       = false
                  + block_public_policy     = false
                  + bucket                  = (known after apply)
                  + id                      = (known after apply)
                  + ignore_public_acls      = false
                  + restrict_public_buckets = false
                }

              # aws_s3_bucket_website_configuration.graasp-dev-account_s3-website-configuration_6ECAAB4F (graasp-dev-account/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-account_s3-website-configuration_6ECAAB4F" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-admin_s3-website-configuration_982EB24B (graasp-dev-admin/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-admin_s3-website-configuration_982EB24B" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-analyzer_s3-website-configuration_97D48C0B (graasp-dev-analyzer/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-analyzer_s3-website-configuration_97D48C0B" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-apps_s3-website-configuration_7E3F72D4 (graasp-dev-apps/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-apps_s3-website-configuration_7E3F72D4" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-assets_s3-website-configuration_6D1735B5 (graasp-dev-assets/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-assets_s3-website-configuration_6D1735B5" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-auth_s3-website-configuration_47B58E1B (graasp-dev-auth/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-auth_s3-website-configuration_47B58E1B" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-builder_s3-website-configuration_AE8DACB7 (graasp-dev-builder/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-builder_s3-website-configuration_AE8DACB7" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-h5p_s3-website-configuration_5FB93898 (graasp-dev-h5p/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-h5p_s3-website-configuration_5FB93898" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-maintenance_s3-website-configuration_50149944 (graasp-dev-maintenance/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-maintenance_s3-website-configuration_50149944" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-pdfviewer_s3-website-configuration_4FC47EE8 (graasp-dev-pdfviewer/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-pdfviewer_s3-website-configuration_4FC47EE8" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_s3_bucket_website_configuration.graasp-dev-player_s3-website-configuration_BA187414 (graasp-dev-player/s3-website-configuration) will be created
              + resource "aws_s3_bucket_website_configuration" "graasp-dev-player_s3-website-configuration_BA187414" {
                  + bucket           = (known after apply)
                  + id               = (known after apply)
                  + routing_rules    = (known after apply)
                  + website_domain   = (known after apply)
                  + website_endpoint = (known after apply)

                  + error_document {
                      + key = "error.html"
                    }

                  + index_document {
                      + suffix = "index.html"
                    }
                }

              # aws_security_group.graasp-dev-backend-security-group (graasp-dev-backend-security-group) will be created
              + resource "aws_security_group" "graasp-dev-backend-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-backend"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-security-group_5536552C (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-security-group) will be created
              + resource "aws_security_group" "graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-security-group_5536552C" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-etherpad-db"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-etherpad-security-group (graasp-dev-etherpad-security-group) will be created
              + resource "aws_security_group" "graasp-dev-etherpad-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-etherpad"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-lb-security-group (graasp-dev-lb-security-group) will be created
              + resource "aws_security_group" "graasp-dev-lb-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-load-balancer"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-library-security-group (graasp-dev-library-security-group) will be created
              + resource "aws_security_group" "graasp-dev-library-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-library"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-meilisearch-security-group (graasp-dev-meilisearch-security-group) will be created
              + resource "aws_security_group" "graasp-dev-meilisearch-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-meilisearch"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-postgres_graasp-dev-db-security-group_6A637215 (graasp-dev-postgres/graasp-dev-db-security-group) will be created
              + resource "aws_security_group" "graasp-dev-postgres_graasp-dev-db-security-group_6A637215" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-db"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_security_group.graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A (graasp-dev-redis/graasp-dev-redis-security-group) will be created
              + resource "aws_security_group" "graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-redis"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # aws_service_discovery_http_namespace.graasp-dev_namespace_B6F7BA2C (graasp-dev/namespace) will be created
              + resource "aws_service_discovery_http_namespace" "graasp-dev_namespace_B6F7BA2C" {
                  + arn         = (known after apply)
                  + description = "Namespace for internal communication between services"
                  + http_name   = (known after apply)
                  + id          = (known after apply)
                  + name        = "graasp"
                  + tags_all    = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-backend-allow-all (graasp-dev-backend-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-backend-allow-all" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-etherpad-allow-all (graasp-dev-etherpad-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-etherpad-allow-all" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-all_5F6AD39A (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-all_5F6AD39A" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-library-allow-all (graasp-dev-library-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-library-allow-all" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB (graasp-dev-load-balancer/graasp-dev-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-meilisearch-allow-all (graasp-dev-meilisearch-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-meilisearch-allow-all" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53 (graasp-dev-postgres/graasp-dev-db-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56 (graasp-dev-redis/graasp-dev-redis-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-backend-allow-load-balancer (graasp-dev-backend-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-backend-allow-load-balancer" {
                  + arn                          = (known after apply)
                  + from_port                    = 3111
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 3111
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-allow-load-balancer (graasp-dev-etherpad-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-etherpad-allow-load-balancer" {
                  + arn                          = (known after apply)
                  + from_port                    = 9001
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 9001
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-load-balancer_F7923A38 (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-load-balancer_F7923A38" {
                  + arn                          = (known after apply)
                  + from_port                    = 5432
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 5432
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-library-allow-load-balancer (graasp-dev-library-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-library-allow-load-balancer" {
                  + arn                          = (known after apply)
                  + from_port                    = 3005
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 3005
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http-ipv6_91743348 (graasp-dev-load-balancer/allow-http-ipv6) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-load-balancer_allow-http-ipv6_91743348" {
                  + arn                    = (known after apply)
                  + cidr_ipv6              = "::/0"
                  + from_port              = 80
                  + id                     = (known after apply)
                  + ip_protocol            = "tcp"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                = 80
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http_0E987E63 (graasp-dev-load-balancer/allow-http) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-load-balancer_allow-http_0E987E63" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + from_port              = 80
                  + id                     = (known after apply)
                  + ip_protocol            = "tcp"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                = 80
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https-ipv6_DC496355 (graasp-dev-load-balancer/allow-https-ipv6) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-load-balancer_allow-https-ipv6_DC496355" {
                  + arn                    = (known after apply)
                  + cidr_ipv6              = "::/0"
                  + from_port              = 443
                  + id                     = (known after apply)
                  + ip_protocol            = "tcp"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                = 443
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https_0223BC47 (graasp-dev-load-balancer/allow-https) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-load-balancer_allow-https_0223BC47" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + from_port              = 443
                  + id                     = (known after apply)
                  + ip_protocol            = "tcp"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                = 443
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-load-balancer (graasp-dev-meilisearch-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-meilisearch-allow-load-balancer" {
                  + arn                          = (known after apply)
                  + from_port                    = 7700
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 7700
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-load-balancer_B5379AF7 (graasp-dev-postgres/graasp-dev-db-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-postgres_graasp-dev-db-allow-load-balancer_B5379AF7" {
                  + arn                          = (known after apply)
                  + from_port                    = 5432
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 5432
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-redis_graasp-dev-redis-allow-load-balancer_7AAB0A26 (graasp-dev-redis/graasp-dev-redis-allow-load-balancer) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-redis_graasp-dev-redis-allow-load-balancer_7AAB0A26" {
                  + arn                          = (known after apply)
                  + from_port                    = 6379
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = (known after apply)
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 6379
                }

              # module.vpc.aws_default_network_acl.this[0] will be created
              + resource "aws_default_network_acl" "this" {
                  + arn                    = (known after apply)
                  + default_network_acl_id = (known after apply)
                  + id                     = (known after apply)
                  + owner_id               = (known after apply)
                  + tags                   = {
                      + "Name" = "graasp-dev-default"
                    }
                  + tags_all               = {
                      + "Name"              = "graasp-dev-default"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)

                  + egress {
                      + action          = "allow"
                      + from_port       = 0
                      + ipv6_cidr_block = "::/0"
                      + protocol        = "-1"
                      + rule_no         = 101
                      + to_port         = 0
                    }
                  + egress {
                      + action     = "allow"
                      + cidr_block = "0.0.0.0/0"
                      + from_port  = 0
                      + protocol   = "-1"
                      + rule_no    = 100
                      + to_port    = 0
                    }

                  + ingress {
                      + action          = "allow"
                      + from_port       = 0
                      + ipv6_cidr_block = "::/0"
                      + protocol        = "-1"
                      + rule_no         = 101
                      + to_port         = 0
                    }
                  + ingress {
                      + action     = "allow"
                      + cidr_block = "0.0.0.0/0"
                      + from_port  = 0
                      + protocol   = "-1"
                      + rule_no    = 100
                      + to_port    = 0
                    }
                }

              # module.vpc.aws_default_route_table.default[0] will be created
              + resource "aws_default_route_table" "default" {
                  + arn                    = (known after apply)
                  + default_route_table_id = (known after apply)
                  + id                     = (known after apply)
                  + owner_id               = (known after apply)
                  + route                  = (known after apply)
                  + tags                   = {
                      + "Name" = "graasp-dev-default"
                    }
                  + tags_all               = {
                      + "Name"              = "graasp-dev-default"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)

                  + timeouts {
                      + create = "5m"
                      + update = "5m"
                    }
                }

              # module.vpc.aws_default_security_group.this[0] will be created
              + resource "aws_default_security_group" "this" {
                  + arn                    = (known after apply)
                  + description            = (known after apply)
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = (known after apply)
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags                   = {
                      + "Name" = "graasp-dev-default"
                    }
                  + tags_all               = {
                      + "Name"              = "graasp-dev-default"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = (known after apply)
                }

              # module.vpc.aws_internet_gateway.this[0] will be created
              + resource "aws_internet_gateway" "this" {
                  + arn      = (known after apply)
                  + id       = (known after apply)
                  + owner_id = (known after apply)
                  + tags     = {
                      + "Name" = "graasp-dev"
                    }
                  + tags_all = {
                      + "Name"              = "graasp-dev"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id   = (known after apply)
                }

              # module.vpc.aws_route.public_internet_gateway[0] will be created
              + resource "aws_route" "public_internet_gateway" {
                  + destination_cidr_block = "0.0.0.0/0"
                  + gateway_id             = (known after apply)
                  + id                     = (known after apply)
                  + instance_id            = (known after apply)
                  + instance_owner_id      = (known after apply)
                  + network_interface_id   = (known after apply)
                  + origin                 = (known after apply)
                  + route_table_id         = (known after apply)
                  + state                  = (known after apply)

                  + timeouts {
                      + create = "5m"
                    }
                }

              # module.vpc.aws_route_table.public[0] will be created
              + resource "aws_route_table" "public" {
                  + arn              = (known after apply)
                  + id               = (known after apply)
                  + owner_id         = (known after apply)
                  + propagating_vgws = (known after apply)
                  + route            = (known after apply)
                  + tags             = {
                      + "Name" = "graasp-dev-public"
                    }
                  + tags_all         = {
                      + "Name"              = "graasp-dev-public"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id           = (known after apply)
                }

              # module.vpc.aws_route_table_association.public[0] will be created
              + resource "aws_route_table_association" "public" {
                  + id             = (known after apply)
                  + route_table_id = (known after apply)
                  + subnet_id      = (known after apply)
                }

              # module.vpc.aws_route_table_association.public[1] will be created
              + resource "aws_route_table_association" "public" {
                  + id             = (known after apply)
                  + route_table_id = (known after apply)
                  + subnet_id      = (known after apply)
                }

              # module.vpc.aws_route_table_association.public[2] will be created
              + resource "aws_route_table_association" "public" {
                  + id             = (known after apply)
                  + route_table_id = (known after apply)
                  + subnet_id      = (known after apply)
                }

              # module.vpc.aws_subnet.public[0] will be created
              + resource "aws_subnet" "public" {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "eu-central-1a"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "172.32.1.0/24"
                  + enable_dns64                                   = false
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_public_ip_on_launch                        = false
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + tags                                           = {
                      + "Name" = "graasp-dev-public-eu-central-1a"
                    }
                  + tags_all                                       = {
                      + "Name"              = "graasp-dev-public-eu-central-1a"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                                         = (known after apply)
                }

              # module.vpc.aws_subnet.public[1] will be created
              + resource "aws_subnet" "public" {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "eu-central-1b"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "172.32.2.0/24"
                  + enable_dns64                                   = false
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_public_ip_on_launch                        = false
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + tags                                           = {
                      + "Name" = "graasp-dev-public-eu-central-1b"
                    }
                  + tags_all                                       = {
                      + "Name"              = "graasp-dev-public-eu-central-1b"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                                         = (known after apply)
                }

              # module.vpc.aws_subnet.public[2] will be created
              + resource "aws_subnet" "public" {
                  + arn                                            = (known after apply)
                  + assign_ipv6_address_on_creation                = false
                  + availability_zone                              = "eu-central-1c"
                  + availability_zone_id                           = (known after apply)
                  + cidr_block                                     = "172.32.3.0/24"
                  + enable_dns64                                   = false
                  + enable_resource_name_dns_a_record_on_launch    = false
                  + enable_resource_name_dns_aaaa_record_on_launch = false
                  + id                                             = (known after apply)
                  + ipv6_cidr_block_association_id                 = (known after apply)
                  + ipv6_native                                    = false
                  + map_public_ip_on_launch                        = false
                  + owner_id                                       = (known after apply)
                  + private_dns_hostname_type_on_launch            = (known after apply)
                  + tags                                           = {
                      + "Name" = "graasp-dev-public-eu-central-1c"
                    }
                  + tags_all                                       = {
                      + "Name"              = "graasp-dev-public-eu-central-1c"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                                         = (known after apply)
                }

              # module.vpc.aws_vpc.this[0] will be created
              + resource "aws_vpc" "this" {
                  + arn                                  = (known after apply)
                  + cidr_block                           = "172.32.0.0/16"
                  + default_network_acl_id               = (known after apply)
                  + default_route_table_id               = (known after apply)
                  + default_security_group_id            = (known after apply)
                  + dhcp_options_id                      = (known after apply)
                  + enable_dns_hostnames                 = true
                  + enable_dns_support                   = true
                  + enable_network_address_usage_metrics = (known after apply)
                  + id                                   = (known after apply)
                  + instance_tenancy                     = "default"
                  + ipv6_association_id                  = (known after apply)
                  + ipv6_cidr_block                      = (known after apply)
                  + ipv6_cidr_block_network_border_group = (known after apply)
                  + main_route_table_id                  = (known after apply)
                  + owner_id                             = (known after apply)
                  + tags                                 = {
                      + "Name" = "graasp-dev"
                    }
                  + tags_all                             = {
                      + "Name"              = "graasp-dev"
                      + "terraform-managed" = "true"
                    }
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_db_instance.this[0] will be created
              + resource "aws_db_instance" "this" {
                  + address                               = (known after apply)
                  + allocated_storage                     = 20
                  + allow_major_version_upgrade           = false
                  + apply_immediately                     = true
                  + arn                                   = (known after apply)
                  + auto_minor_version_upgrade            = true
                  + availability_zone                     = "eu-central-1c"
                  + backup_retention_period               = 1
                  + backup_target                         = (known after apply)
                  + backup_window                         = "21:30-22:00"
                  + ca_cert_identifier                    = (known after apply)
                  + character_set_name                    = (known after apply)
                  + copy_tags_to_snapshot                 = true
                  + db_name                               = "graasp_etherpad"
                  + db_subnet_group_name                  = (known after apply)
                  + delete_automated_backups              = true
                  + deletion_protection                   = true
                  + endpoint                              = (known after apply)
                  + engine                                = "postgres"
                  + engine_version                        = "15.2"
                  + engine_version_actual                 = (known after apply)
                  + final_snapshot_identifier             = (known after apply)
                  + hosted_zone_id                        = (known after apply)
                  + iam_database_authentication_enabled   = false
                  + id                                    = (known after apply)
                  + identifier                            = "graasp-dev-etherpad"
                  + identifier_prefix                     = (known after apply)
                  + instance_class                        = "db.t3.micro"
                  + iops                                  = (known after apply)
                  + kms_key_id                            = (known after apply)
                  + latest_restorable_time                = (known after apply)
                  + license_model                         = (known after apply)
                  + listener_endpoint                     = (known after apply)
                  + maintenance_window                    = "sat:00:08-sat:00:38"
                  + master_user_secret                    = (known after apply)
                  + master_user_secret_kms_key_id         = (known after apply)
                  + max_allocated_storage                 = 1000
                  + monitoring_interval                   = 60
                  + monitoring_role_arn                   = (known after apply)
                  + multi_az                              = false
                  + nchar_character_set_name              = (known after apply)
                  + network_type                          = (known after apply)
                  + option_group_name                     = (known after apply)
                  + parameter_group_name                  = (known after apply)
                  + password                              = (sensitive value)
                  + performance_insights_enabled          = true
                  + performance_insights_kms_key_id       = (known after apply)
                  + performance_insights_retention_period = 7
                  + port                                  = 5432
                  + publicly_accessible                   = false
                  + replica_mode                          = (known after apply)
                  + replicas                              = (known after apply)
                  + resource_id                           = (known after apply)
                  + skip_final_snapshot                   = false
                  + snapshot_identifier                   = (known after apply)
                  + status                                = (known after apply)
                  + storage_encrypted                     = true
                  + storage_throughput                    = (known after apply)
                  + storage_type                          = "gp2"
                  + tags_all                              = {
                      + "terraform-managed" = "true"
                    }
                  + timezone                              = (known after apply)
                  + username                              = "graasp"
                  + vpc_security_group_ids                = (known after apply)

                  + timeouts {}
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
              + resource "aws_iam_role" "enhanced_monitoring" {
                  + arn                   = (known after apply)
                  + assume_role_policy    = jsonencode(
                        {
                          + Statement = [
                              + {
                                  + Action    = "sts:AssumeRole"
                                  + Effect    = "Allow"
                                  + Principal = {
                                      + Service = "monitoring.rds.amazonaws.com"
                                    }
                                },
                            ]
                          + Version   = "2012-10-17"
                        }
                    )
                  + create_date           = (known after apply)
                  + force_detach_policies = false
                  + id                    = (known after apply)
                  + managed_policy_arns   = (known after apply)
                  + max_session_duration  = 3600
                  + name                  = "graasp-dev-etherpad-rds-monitoring-role"
                  + name_prefix           = (known after apply)
                  + path                  = "/"
                  + tags                  = {
                      + "Name" = "graasp-dev-etherpad-rds-monitoring-role"
                    }
                  + tags_all              = {
                      + "Name"              = "graasp-dev-etherpad-rds-monitoring-role"
                      + "terraform-managed" = "true"
                    }
                  + unique_id             = (known after apply)
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
              + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
                  + id         = (known after apply)
                  + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
                  + role       = "graasp-dev-etherpad-rds-monitoring-role"
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.random_id.snapshot_identifier[0] will be created
              + resource "random_id" "snapshot_identifier" {
                  + b64_std     = (known after apply)
                  + b64_url     = (known after apply)
                  + byte_length = 4
                  + dec         = (known after apply)
                  + hex         = (known after apply)
                  + id          = (known after apply)
                  + keepers     = {
                      + "id" = "graasp-dev-etherpad"
                    }
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
              + resource "aws_db_parameter_group" "this" {
                  + arn         = (known after apply)
                  + description = "graasp-postgres15 parameter group"
                  + family      = "postgres15"
                  + id          = (known after apply)
                  + name        = (known after apply)
                  + name_prefix = "graasp-postgres15-"
                  + tags        = {
                      + "Name" = "graasp-postgres15"
                    }
                  + tags_all    = {
                      + "Name"              = "graasp-postgres15"
                      + "terraform-managed" = "true"
                    }

                  + parameter {
                      + apply_method = "immediate"
                      + name         = "rds.force_ssl"
                      + value        = "0"
                    }
                }

              # module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
              + resource "aws_db_subnet_group" "this" {
                  + arn                     = (known after apply)
                  + description             = "graasp-dev-etherpad subnet group"
                  + id                      = (known after apply)
                  + name                    = (known after apply)
                  + name_prefix             = "graasp-dev-etherpad-"
                  + subnet_ids              = (known after apply)
                  + supported_network_types = (known after apply)
                  + tags                    = {
                      + "Name" = "graasp-dev-etherpad"
                    }
                  + tags_all                = {
                      + "Name"              = "graasp-dev-etherpad"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                  = (known after apply)
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0] will be created
              + resource "aws_db_instance" "this" {
                  + address                               = (known after apply)
                  + allocated_storage                     = 20
                  + allow_major_version_upgrade           = false
                  + apply_immediately                     = true
                  + arn                                   = (known after apply)
                  + auto_minor_version_upgrade            = true
                  + availability_zone                     = "eu-central-1a"
                  + backup_retention_period               = 1
                  + backup_target                         = (known after apply)
                  + backup_window                         = "21:30-22:00"
                  + ca_cert_identifier                    = (known after apply)
                  + character_set_name                    = (known after apply)
                  + copy_tags_to_snapshot                 = true
                  + db_name                               = "graasp"
                  + db_subnet_group_name                  = (known after apply)
                  + delete_automated_backups              = true
                  + deletion_protection                   = true
                  + endpoint                              = (known after apply)
                  + engine                                = "postgres"
                  + engine_version                        = "15.2"
                  + engine_version_actual                 = (known after apply)
                  + final_snapshot_identifier             = (known after apply)
                  + hosted_zone_id                        = (known after apply)
                  + iam_database_authentication_enabled   = false
                  + id                                    = (known after apply)
                  + identifier                            = "graasp-dev"
                  + identifier_prefix                     = (known after apply)
                  + instance_class                        = "db.t3.micro"
                  + iops                                  = (known after apply)
                  + kms_key_id                            = (known after apply)
                  + latest_restorable_time                = (known after apply)
                  + license_model                         = (known after apply)
                  + listener_endpoint                     = (known after apply)
                  + maintenance_window                    = "sat:00:08-sat:00:38"
                  + master_user_secret                    = (known after apply)
                  + master_user_secret_kms_key_id         = (known after apply)
                  + max_allocated_storage                 = 1000
                  + monitoring_interval                   = 60
                  + monitoring_role_arn                   = (known after apply)
                  + multi_az                              = false
                  + nchar_character_set_name              = (known after apply)
                  + network_type                          = (known after apply)
                  + option_group_name                     = (known after apply)
                  + parameter_group_name                  = (known after apply)
                  + password                              = (sensitive value)
                  + performance_insights_enabled          = true
                  + performance_insights_kms_key_id       = (known after apply)
                  + performance_insights_retention_period = 7
                  + port                                  = 5432
                  + publicly_accessible                   = false
                  + replica_mode                          = (known after apply)
                  + replicas                              = (known after apply)
                  + resource_id                           = (known after apply)
                  + skip_final_snapshot                   = false
                  + snapshot_identifier                   = (known after apply)
                  + status                                = (known after apply)
                  + storage_encrypted                     = true
                  + storage_throughput                    = (known after apply)
                  + storage_type                          = "gp2"
                  + tags_all                              = {
                      + "terraform-managed" = "true"
                    }
                  + timezone                              = (known after apply)
                  + username                              = "graasp"
                  + vpc_security_group_ids                = (known after apply)

                  + timeouts {}
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
              + resource "aws_iam_role" "enhanced_monitoring" {
                  + arn                   = (known after apply)
                  + assume_role_policy    = jsonencode(
                        {
                          + Statement = [
                              + {
                                  + Action    = "sts:AssumeRole"
                                  + Effect    = "Allow"
                                  + Principal = {
                                      + Service = "monitoring.rds.amazonaws.com"
                                    }
                                },
                            ]
                          + Version   = "2012-10-17"
                        }
                    )
                  + create_date           = (known after apply)
                  + force_detach_policies = false
                  + id                    = (known after apply)
                  + managed_policy_arns   = (known after apply)
                  + max_session_duration  = 3600
                  + name                  = "graasp-dev-rds-monitoring-role"
                  + name_prefix           = (known after apply)
                  + path                  = "/"
                  + tags                  = {
                      + "Name" = "graasp-dev-rds-monitoring-role"
                    }
                  + tags_all              = {
                      + "Name"              = "graasp-dev-rds-monitoring-role"
                      + "terraform-managed" = "true"
                    }
                  + unique_id             = (known after apply)
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
              + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
                  + id         = (known after apply)
                  + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
                  + role       = "graasp-dev-rds-monitoring-role"
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.random_id.snapshot_identifier[0] will be created
              + resource "random_id" "snapshot_identifier" {
                  + b64_std     = (known after apply)
                  + b64_url     = (known after apply)
                  + byte_length = 4
                  + dec         = (known after apply)
                  + hex         = (known after apply)
                  + id          = (known after apply)
                  + keepers     = {
                      + "id" = "graasp-dev"
                    }
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
              + resource "aws_db_parameter_group" "this" {
                  + arn         = (known after apply)
                  + description = "graasp-postgres15 parameter group"
                  + family      = "postgres15"
                  + id          = (known after apply)
                  + name        = (known after apply)
                  + name_prefix = "graasp-postgres15-"
                  + tags        = {
                      + "Name" = "graasp-postgres15"
                    }
                  + tags_all    = {
                      + "Name"              = "graasp-postgres15"
                      + "terraform-managed" = "true"
                    }

                  + parameter {
                      + apply_method = "immediate"
                      + name         = "rds.force_ssl"
                      + value        = "0"
                    }
                }

              # module.graasp-dev-postgres_db_F1D5DB7A.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
              + resource "aws_db_subnet_group" "this" {
                  + arn                     = (known after apply)
                  + description             = "graasp-dev subnet group"
                  + id                      = (known after apply)
                  + name                    = (known after apply)
                  + name_prefix             = "graasp-dev-"
                  + subnet_ids              = (known after apply)
                  + supported_network_types = (known after apply)
                  + tags                    = {
                      + "Name" = "graasp-dev"
                    }
                  + tags_all                = {
                      + "Name"              = "graasp-dev"
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                  = (known after apply)
                }

            Plan: 140 to add, 0 to change, 0 to destroy.

            ─────────────────────────────────────────────────────────────────────────────

            Saved the plan to: plan

            To perform exactly these actions, run the following command to apply:
                terraform apply "plan"


```

</details>